DataProcessors/ЗаменаТарифовСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗаменаТарифовСчетчиков</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТарифыКоммунальныхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТарифыКоммунальныхУслуг</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КоммунальнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоммунальныеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АбонплатыКоммунальныхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АбонплатыКоммунальныхУслуг</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Абонплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КоммунальнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоммунальныеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПривязкаСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПривязкаСчетчиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеПоказанияСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеПоказанияСчетчиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НачислениеКоммунальныхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НачислениеКоммунальныхУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗатратыОбъектов</xr:Item>
				<xr:Item>InformationRegister.ПредыдущиеПоказанияСчетчиков</xr:Item>
				<xr:Item>AccumulationRegister.НачисленияКоммунальныхУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКоммунальнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКоммунальныхУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоммунальнаяУслуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КоммунальныеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубПотребитель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПотребительКоммунальныхУслуг</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоммунальнаяУслугаСуб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КоммунальныеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотреблениеФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотреблениеАкт</Name>
							<Comment>Потребление по акту</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потери</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотреблениеИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предоплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКОплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗатрат</Name>
							<Comment>Затраты по точке</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредыдущие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияТекущие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потребление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗаменаТарифовСчетчиков/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Тариф = Истина;
	НаДату = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ТарифПриИзменении(Элемент)
	тзУслуги.Очистить();
	Элементы.тзУслугиГруппаТариф.Видимость = Тариф;
	Элементы.тзУслугиГруппаАбонплата.Видимость = НЕ Тариф;
	Элементы.ГруппаТарифы.Заголовок = Формат(Тариф,"БЛ=Абонплата; БИ=Тариф");
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьУслугиНаСервере()
	
	Запрос = Новый Запрос;
	
	Если Тариф Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоммунальныеУслуги.Ссылка КАК КоммунальнаяУслуга,
		|	РегистрСведенийСрезПоследних.Период КАК Период,
		|	РегистрСведенийСрезПоследних.Тариф КАК Тариф
		|ИЗ
		|	Справочник.КоммунальныеУслуги КАК КоммунальныеУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыКоммунальныхУслуг.СрезПоследних(, ) КАК РегистрСведенийСрезПоследних
		|		ПО КоммунальныеУслуги.Ссылка = РегистрСведенийСрезПоследних.КоммунальнаяУслуга
		|ГДЕ
		|	НЕ КоммунальныеУслуги.ЭтоГруппа
		|	И КоммунальныеУслуги.Ссылка В ИЕРАРХИИ(&КоммунальнаяУслуга)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоммунальнаяУслуга
		|АВТОУПОРЯДОЧИВАНИЕ";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоммунальныеУслуги.Ссылка КАК КоммунальнаяУслуга,
		|	РегистрСведенийСрезПоследних.Период КАК Период,
		|	РегистрСведенийСрезПоследних.Абонплата КАК Абонплата
		|ИЗ
		|	Справочник.КоммунальныеУслуги КАК КоммунальныеУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АбонплатыКоммунальныхУслуг.СрезПоследних(, ) КАК РегистрСведенийСрезПоследних
		|		ПО КоммунальныеУслуги.Ссылка = РегистрСведенийСрезПоследних.КоммунальнаяУслуга
		|ГДЕ
		|	НЕ КоммунальныеУслуги.ЭтоГруппа
		|	И КоммунальныеУслуги.Абонплата
		|	И КоммунальныеУслуги.Ссылка В ИЕРАРХИИ(&КоммунальнаяУслуга)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоммунальнаяУслуга
		|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КоммунальнаяУслуга", КоммунальнаяУслуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить();
	
	тзУслуги.Загрузить(Результат);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьУслуги(Команда)
	КомандаЗаполнитьУслугиНаСервере();
	Элементы.ФормаКомандаСохранить.Доступность = тзУслуги.Количество();
КонецПроцедуры

&НаКлиенте
Процедура тзУслугиПослеУдаления(Элемент)
	Элементы.ФормаКомандаСохранить.Доступность = тзУслуги.Количество() Или тзСчетчики.Количество();
КонецПроцедуры

&НаСервере
Процедура СохранитьДанные()
	Если Тариф Тогда
		Для Каждого строка из тзУслуги Цикл
			Если ЗначениеЗаполнено(строка.НовыйТариф) Тогда
				Запись = РегистрыСведений.ТарифыКоммунальныхУслуг.СоздатьМенеджерЗаписи();
				Запись.Период = НаДату;
				Запись.КоммунальнаяУслуга = строка.КоммунальнаяУслуга;
				Запись.Тариф = строка.НовыйТариф;
				Запись.Записать(Истина)
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого строка из тзУслуги Цикл
			Если ЗначениеЗаполнено(строка.НоваяАбонплата) Тогда
				Запись = РегистрыСведений.АбонплатыКоммунальныхУслуг.СоздатьМенеджерЗаписи();
				Запись.Период = НаДату;
				Запись.КоммунальнаяУслуга = строка.КоммунальнаяУслуга;
				Запись.Абонплата = строка.НоваяАбонплата;
				Запись.Записать(Истина)
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаменитьСчетчик()
	Автор = Пользователи.ТекущийПользователь();
	
	НачатьТранзакцию();
	
	ДокОбъект = Документы.НачислениеКоммунальныхУслуг.СоздатьДокумент();
	ДокОбъект.Автор = Автор;
	ДокОбъект.Дата = ТекущаяДата();
	ДокОбъект.ПодразделениеКомпании	= ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ДокОбъект.ПодразделениеКомпании);
	ДокОбъект.ОтчетныйМесяц	= НачалоМесяца(НаДату);
	ДокОбъект.ХозОперация = Справочники.ХозОперации.ВводНачальныхПоказанийСчетчиков;
	тчПоказания = ДокОбъект.Показания;
	
	Для Каждого строка из тзСчетчики Цикл
		Если ЗначениеЗаполнено(строка.Счетчик) И ЗначениеЗаполнено(строка.ТорговаяПлощадка) Тогда
			
			СчетчикНовыйОбъект = строка.СчетчикНовый.ПолучитьОбъект();
			СчетчикНовыйОбъект.ЛицевойСчет = строка.Счетчик.ЛицевойСчет;
			СчетчикНовыйОбъект.Записать();
			
			СчетчикОбъект = строка.Счетчик.ПолучитьОбъект();
			СчетчикОбъект.ЛицевойСчет = "";
			СчетчикОбъект.Записать();
			
			Запись = РегистрыСведений.ПривязкаСчетчиков.СоздатьМенеджерЗаписи();
			Запись.Период = НаДату;
			Запись.ТорговаяПлощадка = "";
			Запись.Счетчик = строка.Счетчик;
			Запись.Автор = Автор;
			Запись.Записать(Истина);
			
			Запись = РегистрыСведений.ПривязкаСчетчиков.СоздатьМенеджерЗаписи();
			Запись.Период = НаДату;
			Запись.ТорговаяПлощадка = строка.ТорговаяПлощадка;
			Запись.Счетчик = строка.СчетчикНовый;
			Запись.Автор = Автор;
			Запись.Записать(Истина);
			
			Запись = РегистрыСведений.ТекущиеПоказанияСчетчиков.СоздатьМенеджерЗаписи();
			Запись.Период = НаДату;
			Запись.ТорговаяПлощадка = строка.ТорговаяПлощадка;
			Запись.Счетчик = строка.Счетчик;
			Запись.Показания = строка.ПоказанияТекущие;
			Запись.Автор = Автор;
			Запись.Записать(Истина);
			
			Запись = РегистрыСведений.ТекущиеПоказанияСчетчиков.СоздатьМенеджерЗаписи();
			Запись.Период = НаДату;
			Запись.ТорговаяПлощадка = строка.ТорговаяПлощадка;
			Запись.Счетчик = строка.СчетчикНовый;
			Запись.Показания = строка.ПоказанияНачальные;
			Запись.Автор = Автор;
			Запись.Записать(Истина);
			
			нСтрока = тчПоказания.Добавить();
			нСтрока.ТорговаяПлощадка = строка.ТорговаяПлощадка;
			нСтрока.Счетчик = строка.СчетчикНовый;
			нСтрока.ПоказанияТекущие = строка.ПоказанияНачальные;
		КонецЕсли;
	КонецЦикла;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаТарифы" Тогда
		СохранитьДанные();
		Сообщить(Формат(Тариф,"БЛ=Абонплата; БИ=Тариф") + " сохранен.");
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаЗаменаСчетчика" Тогда
		ЗаменитьСчетчик();
		Сообщить("Счетчик заменен.");
	Иначе
		Сообщить("Упс");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьСчетчикиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПривязкаСчетчиковСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ПривязкаСчетчиковСрезПоследних.Счетчик КАК Счетчик,
	|	ТекущиеПоказанияСчетчиковСрезПоследних.Показания КАК ПоказанияПредыдущие
	|ИЗ
	|	РегистрСведений.ПривязкаСчетчиков.СрезПоследних(, ТорговаяПлощадка = &ТорговаяПлощадка) КАК ПривязкаСчетчиковСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеПоказанияСчетчиков.СрезПоследних КАК ТекущиеПоказанияСчетчиковСрезПоследних
	|		ПО ПривязкаСчетчиковСрезПоследних.Счетчик = ТекущиеПоказанияСчетчиковСрезПоследних.Счетчик
	|			И ПривязкаСчетчиковСрезПоследних.ТорговаяПлощадка = ТекущиеПоказанияСчетчиковСрезПоследних.ТорговаяПлощадка";
	
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(тзСчетчики.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьСчетчики(Команда)
	КомандаЗаполнитьСчетчикиНаСервере();
	Элементы.ФормаКомандаСохранить.Доступность = тзСчетчики.Количество();
КонецПроцедуры

&НаКлиенте
Процедура тзСчетчикиПоказанияТекущиеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.тзСчетчики.ТекущиеДанные;
	Если ТекущиеДанные.ПоказанияПредыдущие > ТекущиеДанные.ПоказанияТекущие Тогда
		ПоказатьПредупреждение(,"Странно, Предыдущие показания больше текущих!!!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура тзСчетчикиПослеУдаления(Элемент)
	Элементы.ФормаКомандаСохранить.Доступность = тзУслуги.Количество() Или тзСчетчики.Количество();
КонецПроцедуры

&НаСервере
Процедура КомандаСохранитьИзТабДокаНаСервере()
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область());
	//ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	//ПЗ.ЗаполнитьНастройки();
	ПЗ.Выполнить();
	ТЗ = ПЗ.Результат.Выгрузить();
	Для Каждого тп из ТЗ Цикл
		тпСсылка = Справочники.КоммунальныеУслуги.НайтиПоНаименованию(тп.КоммунальнаяУслуга);
		Если тпСсылка.Пустая() Тогда
			ОбщегоНазначения.СообщитьПользователю("Не найдена " + тп.КоммунальнаяУслуга);
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(тп.Тариф) Тогда
			Запись = РегистрыСведений.ТарифыКоммунальныхУслуг.СоздатьМенеджерЗаписи();
			Запись.Период = НаДату;
			Запись.КоммунальнаяУслуга = тпСсылка;
			Запись.Тариф = тп.Тариф;
			Запись.Записать(Истина)
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьИзТабДока(Команда)
	КомандаСохранитьИзТабДокаНаСервере();
	Сообщить("Тарифы сохранены..");
КонецПроцедуры
